// 系统常量
const DEFAULT_CONFIG = {
  // 密码正则
  PASSWORD_REG:
    /^(?![a-zA-Z]+$)(?![A-Z0-9]+$)(?![A-Z\W_!@#$%^&*`~()-+=]+$)(?![a-z0-9]+$)(?![a-z\W_!@#$%^&*`~()-+=]+$)(?![0-9\W_!@#$%^&*`~()-+=]+$)[a-zA-Z0-9\W_!@#$%^&*`~()-+=]{8,30}$/,
  PASSWORD_REG_MSG: '密码8到12位包含大小写字母，数字，特殊字符！',
  // 邮箱正则
  EMAIL_REG: /^([a-zA-Z0-9]+[_|_|.]?)*[a-zA-Z0-9]+@([a-zA-Z0-9]+[_|_|.]?)*[a-zA-Z0-9]+\.[a-zA-Z]{2,3}$/,
  EMAIL_REG_MSG: '邮箱格式不正确',
  MOBILE_PHONE_REG: /^(0|86|17951)?(13[0-9]|15[012356789]|17[678]|18[0-9]|14[57])[0-9]{8}$/,
  MOBILE_PHONE_REG_MSG: '手机号不正确',
  ID_CARD_NO_REG: /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X)$/,
  ID_CARD_NO_REG_MSG: '身份证格式不正确',
}
export * from './common'
export default DEFAULT_CONFIG
